#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

data.aws_subnet.subnet_b: Reading...
data.aws_subnet.subnet_a: Reading...
aws_elastic_beanstalk_application.task-listing-app: Refreshing state... [id=task-listing-app]
aws_iam_role.task-listing-app-role: Refreshing state... [id=task-listing-app-ec2-instance-role]
aws_ecr_repository.task-lising-app-ecr: Refreshing state... [id=taskappecr]
aws_s3_bucket.task-listing-app-bucket: Refreshing state... [id=task-listing-app-bucket]
data.aws_subnet.subnet_c: Reading...
aws_db_subnet_group.db_subnet_group: Refreshing state... [id=dbsubnetgroup]
aws_iam_role_policy_attachment.worker: Refreshing state... [id=task-listing-app-ec2-instance-role-20230930173108938100000002]
aws_iam_role_policy_attachment.docker: Refreshing state... [id=task-listing-app-ec2-instance-role-20230930173108769100000001]
aws_iam_role_policy_attachment.webtier: Refreshing state... [id=task-listing-app-ec2-instance-role-20230930173108944700000003]
aws_iam_role_policy_attachment.readonly: Refreshing state... [id=task-listing-app-ec2-instance-role-20230930173108947700000004]
aws_iam_instance_profile.task-listing-app-profile: Refreshing state... [id=task-listing-app-instance-profile-ec2-instance-profile2]
data.aws_subnet.subnet_a: Read complete after 1s [id=subnet-07817b04f14c3ba83]
data.aws_subnet.subnet_b: Read complete after 1s [id=subnet-0f5c6a45095190c27]
data.aws_subnet.subnet_c: Read complete after 1s [id=subnet-04208ac89fa9534a4]
aws_db_instance.rds_app: Refreshing state... [id=db-Q7LTXVXBBKQHZ7BS6QLW5ODEVY]
aws_ecr_lifecycle_policy.task-listing-app-ecr-lifecycle-policy: Refreshing state... [id=taskappecr]
aws_elastic_beanstalk_environment.task-listing-app-environment: Refreshing state... [id=e-2qrgb3r8mx]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_db_instance.rds_app will be updated in-place
  ~ resource "aws_db_instance" "rds_app" {
        id                                    = "db-Q7LTXVXBBKQHZ7BS6QLW5ODEVY"
      ~ identifier                            = "task-listing-app-db" -> "task-listing-app-db-prod"
        tags                                  = {}
        # (50 unchanged attributes hidden)
    }

  # aws_db_subnet_group.db_subnet_group will be destroyed
  # (because aws_db_subnet_group.db_subnet_group is not in configuration)
  - resource "aws_db_subnet_group" "db_subnet_group" {
      - arn                     = "arn:aws:rds:eu-west-2:310547311731:subgrp:dbsubnetgroup" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "dbsubnetgroup" -> null
      - name                    = "dbsubnetgroup" -> null
      - subnet_ids              = [
          - "subnet-04208ac89fa9534a4",
          - "subnet-07817b04f14c3ba83",
          - "subnet-0f5c6a45095190c27",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name" = "dbsubnetgroup"
        } -> null
      - tags_all                = {
          - "Name" = "dbsubnetgroup"
        } -> null
      - vpc_id                  = "vpc-0d38f63436f126f24" -> null
    }

  # aws_db_subnet_group.dbsubnetgroup will be created
  + resource "aws_db_subnet_group" "dbsubnetgroup" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "dbsubnetgroup"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-04208ac89fa9534a4",
          + "subnet-07817b04f14c3ba83",
          + "subnet-0f5c6a45095190c27",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "dbsubnetgroup"
        }
      + tags_all                = {
          + "Name" = "dbsubnetgroup"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>